/* Localized versions of Info.plist keys */

AMName = "Choose One from List";

/*  AMApplication localized strings  */
/*  e.g. "TextEdit" = "TextEdit";  */

/*  AMCategory localized strings  */
/*  e.g. "Text" = "Text";  */

/*  AMDefaultParameters localized values  */
/*  e.g. myDefaultIntegerParameter = 0;  */
/*  e.g. myDefaultStringParameter = "Default String Value";  */

/*  AMDescription localized strings  */
//AMDAlert = "(* AMDAlert text goes here. (optional) *)";
AMDInput = "Takes a list of strings, e.g., the output of `ls`";
AMDNote = "(* AMDNote text goes here. (optional) *)";
//AMDOptions = "";
AMDResult = "Outputs a string";
AMDRequires = "Once the selector window opens, you'll have to select a string";
//AMDSummary = "(* AMDSummary text to explain what your action does goes here. *)";
//AMDWebsite = "(* AMDWebsite URL to additional information or documentation for the action goes here. (optional) *)";

/*  AMKeyword localized strings  */
/*  e.g. "Filter" = "Filter";  */

/*  AMWarning localized strings  */
ApplyButton = "(* Button label for user to add proposed Action, e.g. Add. *)";
IgnoreButton = "(* Button label for user not to add proposed Action, e.g. Don't Add. *)";
Message = "(* Warning message presented to user goes here. *)";
